cask_args appdir: '/Applications'

tap 'caskroom/cask'

# Terminal Utilities
brew 'tmux'

# CLI Text Utilities
brew "the_silver_searcher"
brew 'peco'
brew 'pstree'
brew 'coreutils'
brew 'nkf'
brew 'colordiff'

# Programming Language
cask 'java'
brew 'lua'
brew 'go'

# Documentation
brew 'doxygen'

# Graphical Tools
brew 'graphviz'
brew 'plantuml'

# Build Tools
brew 'autoconf'
brew 'cmake'
brew 'gradle'
brew 'gradle-completion'

# Debugging
brew 'gdb'

# SCM
brew 'svn'
brew 'git'
brew 'hub'

# Binary
brew 'binutils'

# Serialization
brew 'protobuf'
brew 'jq'

# Databases and so on
brew 'mysql'
brew 'postgresql'
brew 'elasticsearch'
brew 'redis'
brew 'memcached'
brew 'sqlite'

# Editors and IDEs
brew 'neovim'
brew 'editorconfig'
brew 'ctags'

# Applications
brew 'jenkins'

# External Services
brew 'awscli'

# Cask Application
cask 'atom'

# Mac AppStore
mas "LimeChat", id: 414030210
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
mas "YubiKey Personalization Tool", id: 638161122

# Human
# Karabiner: https://github.com/tekezo/Karbiner-Elements/blob/master/usage/README.md
# Google IME: https://www.google.co.jp/ime/
# Iterm2: https://www.iterm2.com/
# Vagrant: https://www.vagrantup.com/downloads.html
# VirtualBox: http://www.oracle.com/technetwork/server-storage/virtualbox/downloads/index.html
