tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/services"
tap "homebrew/versions"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bison"
brew "chromedriver"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "doxygen"
brew "pcre"
brew "editorconfig"
brew "elasticsearch"
brew "libpng"
brew "freetype"
brew "fontconfig"
brew "gmp"
brew "mpfr"
brew "gawk"
brew "jpeg"
brew "libtiff"
brew "webp"
brew "gd"
brew "gdb"
brew "git"
brew "gnu-sed"
brew "gradle"
brew "libtool"
brew "graphviz"
brew "groff"
brew "hub"
brew "xz"
brew "imagemagick"
brew "jenkins"
brew "oniguruma"
brew "jq"
brew "libevent"
brew "lua"
brew "mas"
brew "memcached"
brew "mysql"
brew "nkf"
brew "peco"
brew "pkg-config"
brew "plantuml"
brew "pngquant"
brew "postgresql"
brew "protobuf"
brew "protobuf@2.6"
brew "pstree"
brew "redis", restart_service: true
brew "sqlite"
brew "tmux"
brew "v8@3.15"
brew "vim", args: ["with-lua"]
brew "wget"
cask "atom"
mas "Install macOS Sierra", id: 1127487414
mas "LimeChat", id: 414030210
mas "Nekoze", id: 627505674
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
mas "YubiKey Personalization Tool", id: 638161122
